hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  if ((now - s_lastTickMs) < BATTLE_TICK_MS)
  {
    return;
  }

  s_lastTickMs += BATTLE_TICK_MS;

  uint8_t input = CombatInput_Read();
  uint8_t cpuInput = Battle_AiUpdate(&s_cpuAi, &s_cpu, &s_player, now);

  CombatActor_FaceToward(&s_player, &s_cpu);
  CombatActor_FaceToward(&s_cpu, &s_player);
  CombatActor_Update(&s_player, input, now, 1U);
  CombatActor_Update(&s_cpu, cpuInput, now, 1U);
  Battle_UpdateVizardSkill(now);
  Battle_ResolveHit(&s_player, &s_cpu, now);
  Battle_ResolveHit(&s_cpu, &s_player, now);
  Battle_TrySpawnGetsuga(now);
  Battle_UpdateGetsuga(now);
  Battle_ResolveProjectileHit(&s_getsuga, &s_player, &s_cpu, now);

  if (s_player.hp != s_lastPlayerHp)
  {
    Battle_DrawHealthBar(10U, 15U, s_player.hp, RGB565_ACCENT_CYAN, 0U);
    s_lastPlayerHp = s_player.hp;
  }

  if (s_cpu.hp != s_lastCpuHp)
  {
    Battle_DrawHealthBar(206U, 15U, s_cpu.hp, RGB565_ACCENT_ORANGE, 1U);
    s_lastCpuHp = s_cpu.hp;
  }

  Battle_UpdateActors();
  LCD_Port_Flush();
}

static void Battle_ResolveHit(CombatActor *attacker, CombatActor *target,
                              uint32_t nowMs)
{
  const CombatHitboxDef *hitbox = 0;
  CombatBox hitboxWorld = CombatActor_GetHitboxWorld(attacker, &hitbox);
  CombatBox hurtboxWorld = CombatActor_GetHurtboxWorld(target);

  if ((hitbox == 0) || (attacker->hitConnected != 0U))
  {
    return;
  }

  if (CombatBox_Overlap(hitboxWorld, hurtboxWorld) == 0U)
  {
    return;
  }

  uint8_t blocked = CombatActor_IsBlockingFront(target, attacker);
  CombatActor_ApplyHit(target, attacker, hitbox, nowMs, blocked);

  if (hitbox->oneHitOnly != 0U)
  {
    attacker->hitConnected = 1U;
  }
}

static void Battle_DrawFrame(void)
{
  Battle_DrawBackground();
  Battle_DrawHud();
  Battle_DrawActorsInitial();
  Battle_DrawDebugBoxes();
}

static void Battle_DrawActorsInitial(void)
{
  Battle_DrawActor(&s_player, &s_playerSnapshot);
  Battle_DrawActor(&s_cpu, &s_cpuSnapshot);
}

static void Battle_UpdateActors(void)
{
  BattleActorSnapshot nextPlayer;
  BattleActorSnapshot nextCpu;
  BattleActorSnapshot nextGetsuga;
  BattleActorSnapshot nextChidori;
  uint8_t playerDirty;
  uint8_t cpuDirty;
  uint8_t getsugaDirty;
  uint8_t chidoriDirty;

  Battle_CaptureActor(&s_player, &nextPlayer);
  Battle_CaptureActor(&s_cpu, &nextCpu);
  Battle_CaptureGetsuga(&s_getsuga, &nextGetsuga);
  Battle_CaptureChidori(&s_player, &nextChidori);
  if (nextChidori.valid == 0U)
  {
    Battle_CaptureChidori(&s_cpu, &nextChidori);
  }

  playerDirty = (Battle_ActorSnapshotEqual(&s_playerSnapshot, &nextPlayer) == 0U);
  cpuDirty = (Battle_ActorSnapshotEqual(&s_cpuSnapshot, &nextCpu) == 0U);
  getsugaDirty = (Battle_ActorSnapshotEqual(&s_getsugaSnapshot, &nextGetsuga) == 0U);
  chidoriDirty = (Battle_ActorSnapshotEqual(&s_chidoriSnapshot, &nextChidori) == 0U);

  if ((playerDirty == 0U) && (cpuDirty == 0U) &&
      (getsugaDirty == 0U) && (chidoriDirty == 0U))
  {
    return;
  }

  if (playerDirty != 0U)
  {
    uint8_t allowPlayerSplit =
        ((s_player.character == COMBAT_CHARACTER_VIZARD_ICHIGO) &&
         (s_player.state == COMBAT_ANIM_SKILL) &&
         (s_vizardTeleported != 0U))
            ? 1U
            : 0U;

    Battle_DrawSnapshotChange(&s_playerSnapshot,
                              &nextPlayer,
                              &nextPlayer,
                              &nextCpu,
                              &nextGetsuga,
                              &nextChidori,
                              allowPlayerSplit);
  }

  if (cpuDirty != 0U)
  {
    Battle_DrawSnapshotChange(&s_cpuSnapshot,
                              &nextCpu,
                              &nextPlayer,
                              &nextCpu,
                              &nextGetsuga,
                              &nextChidori,
                              0U);
  }

  if (getsugaDirty != 0U)
  {
    Battle_DrawSnapshotChange(&s_getsugaSnapshot,
                              &nextGetsuga,
                              &nextPlayer,
                              &nextCpu,
                              &nextGetsuga,
                              &nextChidori,
                              0U);
  }

  if (chidoriDirty != 0U)
  {
    Battle_DrawSnapshotChange(&s_chidoriSnapshot,
                              &nextChidori,
                              &nextPlayer,
                              &nextCpu,
                              &nextGetsuga,
                              &nextChidori,
                              0U);
  }

  s_playerSnapshot = nextPlayer;
  s_cpuSnapshot = nextCpu;
  s_getsugaSnapshot = nextGetsuga;
  s_chidoriSnapshot = nextChidori;
}

static void Battle_AiInit(BattleAiController *ai, uint32_t nowMs)
{
  if (ai == 0)
  {
    return;
  }

  ai->visible.valid = 0U;
  ai->pending.valid = 0U;
  ai->action = BATTLE_AI_ACTION_HOLD;
  ai->queuedAction = BATTLE_AI_ACTION_HOLD;
  ai->pendingSeenMs = nowMs;
  ai->actionStartedMs = nowMs;
  ai->actionDurationMs = BATTLE_AI_ACTION_MIN_MS;
  ai->nextThinkMs = nowMs;
  ai->rng = 0x13572468UL;
}

static uint8_t Battle_AiUpdate(BattleAiController *ai,
                               const CombatActor *self,
                               const CombatActor *target,
                               uint32_t nowMs)
{
  if ((ai == 0) || (self == 0) || (target == 0))
  {
    return COMBAT_INPUT_NONE;
  }

  Battle_AiObserve(ai, self, target, nowMs);

  if ((self->state == COMBAT_ANIM_HIT) || (self->state == COMBAT_ANIM_DEAD))
  {
    ai->action = BATTLE_AI_ACTION_HOLD;
    ai->queuedAction = BATTLE_AI_ACTION_HOLD;
    ai->actionStartedMs = nowMs;
    ai->nextThinkMs = nowMs + BATTLE_AI_REACTION_MS;
    return COMBAT_INPUT_NONE;
  }

  uint32_t elapsed = nowMs - ai->actionStartedMs;
  uint8_t locked = CombatActor_IsActionLocked(self, nowMs);
  uint32_t thinkPoint =
      (ai->actionDurationMs * 65U) / 100U;

  if ((self->state == COMBAT_ANIM_ATTACK) &&
      (self->attackStep < 2U))
  {
    return COMBAT_INPUT_ATTACK;
  }

  if ((elapsed >= thinkPoint) && (nowMs >= ai->nextThinkMs))
  {
    ai->queuedAction = Battle_AiChooseAction(ai, self, target, nowMs);
    ai->nextThinkMs = nowMs + 110U + Battle_AiRandom(ai, 90U);
  }

