hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  if ((locked == 0U) &&
      ((elapsed >= ai->actionDurationMs) ||
       (ai->action == BATTLE_AI_ACTION_HOLD)))
  {
    if (ai->action == BATTLE_AI_ACTION_HOLD)
    {
      ai->queuedAction = Battle_AiChooseAction(ai, self, target, nowMs);
    }
    ai->action = ai->queuedAction;
    ai->queuedAction = BATTLE_AI_ACTION_HOLD;
    ai->actionStartedMs = nowMs;
    ai->actionDurationMs = BATTLE_AI_ACTION_MIN_MS +
                           Battle_AiRandom(ai,
                                           (uint16_t)(BATTLE_AI_ACTION_MAX_MS -
                                                      BATTLE_AI_ACTION_MIN_MS));
  }

  return Battle_AiActionToInput(ai->action, self, target, nowMs);
}

static void Battle_AiObserve(BattleAiController *ai,
                             const CombatActor *self,
                             const CombatActor *target,
                             uint32_t nowMs)
{
  if ((ai == 0) || (self == 0) || (target == 0))
  {
    return;
  }

  ai->pending.selfX = self->x;
  ai->pending.targetX = target->x;
  ai->pending.targetY = target->y;
  ai->pending.selfHp = self->hp;
  ai->pending.targetHp = target->hp;
  ai->pending.selfState = self->state;
  ai->pending.targetState = target->state;
  ai->pending.targetFrameIndex = target->frameIndex;
  ai->pending.targetAttackStep = target->attackStep;
  ai->pending.targetOnGround = target->onGround;
  ai->pending.valid = 1U;

  if ((ai->visible.valid == 0U) ||
      ((nowMs - ai->pendingSeenMs) >= BATTLE_AI_REACTION_MS))
  {
    ai->visible = ai->pending;
    ai->pendingSeenMs = nowMs;
  }
}

static BattleAiAction Battle_AiChooseAction(BattleAiController *ai,
                                            const CombatActor *self,
                                            const CombatActor *target,
                                            uint32_t nowMs)
{
  (void)nowMs;

  if ((ai == 0) || (self == 0) || (target == 0) ||
      (ai->visible.valid == 0U))
  {
    return BATTLE_AI_ACTION_HOLD;
  }

  int16_t dx = (int16_t)(ai->visible.targetX - ai->visible.selfX);
  int16_t distance = Battle_AbsI16(dx);
  uint8_t targetAttacking =
      (ai->visible.targetState == COMBAT_ANIM_ATTACK) ||
      (ai->visible.targetState == COMBAT_ANIM_SKILL);
  uint8_t targetActive =
      (targetAttacking != 0U) &&
      (ai->visible.targetFrameIndex >= 2U) &&
      (ai->visible.targetFrameIndex <= 5U);
  uint8_t targetRecovering =
      (targetAttacking != 0U) &&
      (ai->visible.targetFrameIndex > 5U);

  if ((targetRecovering != 0U) &&
      (distance <= BATTLE_AI_ATTACK_RANGE))
  {
    return BATTLE_AI_ACTION_ATTACK;
  }

  if ((ai->visible.targetOnGround == 0U) &&
      (distance <= BATTLE_AI_NEAR_RANGE))
  {
    return BATTLE_AI_ACTION_ATTACK;
  }

  if ((targetActive != 0U) &&
      (distance <= BATTLE_AI_NEAR_RANGE) &&
      (Battle_AiRandom(ai, 100U) < 82U))
  {
    return BATTLE_AI_ACTION_BLOCK;
  }

  if ((distance <= BATTLE_AI_SKILL_RANGE) &&
      ((ai->visible.targetHp <= 45U) || (ai->visible.selfHp <= 35U)) &&
      (Battle_AiRandom(ai, 100U) < 58U))
  {
    return BATTLE_AI_ACTION_SKILL;
  }

  if (distance <= BATTLE_AI_ATTACK_RANGE)
  {
    return BATTLE_AI_ACTION_ATTACK;
  }

  if ((distance <= 34) &&
      (ai->visible.selfHp < ai->visible.targetHp) &&
      (Battle_AiRandom(ai, 100U) < 46U))
  {
    return BATTLE_AI_ACTION_RETREAT;
  }

  if (distance > BATTLE_AI_FAR_RANGE)
  {
    return BATTLE_AI_ACTION_DASH;
  }

  if (distance > BATTLE_AI_ATTACK_RANGE)
  {
    return BATTLE_AI_ACTION_APPROACH;
  }

  if (Battle_AiRandom(ai, 100U) < 18U)
  {
    return BATTLE_AI_ACTION_JUMP;
  }

  return BATTLE_AI_ACTION_HOLD;
}

static uint8_t Battle_AiActionToInput(BattleAiAction action,
                                      const CombatActor *self,
                                      const CombatActor *target,
                                      uint32_t nowMs)
{
  (void)nowMs;

  if ((self == 0) || (target == 0))
  {
    return COMBAT_INPUT_NONE;
  }

  uint8_t toward = (target->x < self->x) ? COMBAT_INPUT_LEFT
                                         : COMBAT_INPUT_RIGHT;
  uint8_t away = (target->x < self->x) ? COMBAT_INPUT_RIGHT
                                       : COMBAT_INPUT_LEFT;

  switch (action)
  {
    case BATTLE_AI_ACTION_APPROACH:
      return toward;
    case BATTLE_AI_ACTION_RETREAT:
      return away;
    case BATTLE_AI_ACTION_BLOCK:
      return COMBAT_INPUT_BLOCK;
    case BATTLE_AI_ACTION_ATTACK:
      return COMBAT_INPUT_ATTACK;
    case BATTLE_AI_ACTION_SKILL:
      return COMBAT_INPUT_SKILL;
    case BATTLE_AI_ACTION_DASH:
      return (uint8_t)(toward | COMBAT_INPUT_DASH);
    case BATTLE_AI_ACTION_JUMP:
      return COMBAT_INPUT_JUMP;
    default:
      return COMBAT_INPUT_NONE;
  }
}

static uint16_t Battle_AiRandom(BattleAiController *ai, uint16_t maxValue)
{
  if ((ai == 0) || (maxValue == 0U))
  {
    return 0U;
  }

  ai->rng = (ai->rng * 1664525UL) + 1013904223UL;
  return (uint16_t)((ai->rng >> 16) % maxValue);
}

static int16_t Battle_AbsI16(int16_t value)
{
  return (value < 0) ? (int16_t)-value : value;
}

static void Battle_UpdateVizardSkill(uint32_t nowMs)
{
  (void)nowMs;

  if ((s_player.character != COMBAT_CHARACTER_VIZARD_ICHIGO) ||
      (s_player.state != COMBAT_ANIM_SKILL))
  {
    s_vizardTeleported = 0U;
    return;
  }

  if (s_lastVizardSkillStartMs != s_player.stateStartedMs)
  {
    s_lastVizardSkillStartMs = s_player.stateStartedMs;
    s_vizardTeleported = 0U;
  }

  if ((s_vizardTeleported != 0U) ||
      (s_player.frameIndex < BATTLE_VIZARD_TELEPORT_FRAME))
  {
    return;
  }

  int16_t targetX = (s_cpu.facing > 0)
                        ? (int16_t)(s_cpu.x - BATTLE_VIZARD_TELEPORT_GAP)
                        : (int16_t)(s_cpu.x + BATTLE_VIZARD_TELEPORT_GAP);

  if (targetX < 32)
  {
    targetX = 32;
  }
  else if (targetX > 288)
  {
    targetX = 288;
  }

  s_player.x = targetX;
  s_player.vx = 0;
  s_player.vy = 0;
  s_player.facing = (s_cpu.x < s_player.x) ? -1 : 1;
  s_vizardTeleported = 1U;
}

static void Battle_DrawActor(const CombatActor *actor,
                             BattleActorSnapshot *snapshot)
{
  if (Battle_CaptureActor(actor, snapshot) == 0U)
  {
    return;
  }

  Battle_DrawActorSnapshot(snapshot);
}

static uint8_t Battle_CaptureActor(const CombatActor *actor,
                                   BattleActorSnapshot *snapshot)
{
  CombatFrameView frame;
  CombatActor viewActor;

  if (snapshot != 0)
  {
    snapshot->valid = 0U;
  }

