hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  if ((actor == 0) || (snapshot == 0))
  {
    return 0U;
  }

  viewActor = *actor;

  if (CombatActor_GetFrame(&viewActor, &frame) == 0U)
  {
    return 0U;
  }

  snapshot->pixels = frame.pixels;
  snapshot->width = frame.width;
  snapshot->height = frame.height;
  snapshot->x = (int16_t)(actor->x - frame.pivotX);
  snapshot->y = (int16_t)(actor->y - frame.pivotY);
  snapshot->flipX = (actor->facing < 0) ? 1U : 0U;
  snapshot->valid = 1U;

  return 1U;
}

static void Battle_TrySpawnGetsuga(uint32_t nowMs)
{
  if ((s_player.character == COMBAT_CHARACTER_VIZARD_ICHIGO) &&
      (s_player.state == COMBAT_ANIM_SKILL) &&
      (s_player.frameIndex >= BATTLE_VIZARD_PROJECTILE_FRAME) &&
      (s_vizardTeleported != 0U) &&
      (s_lastVizardProjectileSkillStartMs != s_player.stateStartedMs))
  {
    const VizardMoveAnimation *projectileAnim =
        &vizard_move_animations[VIZARD_MOVE_SKILL_PROJECTILE];
    const VizardMoveFrame *frame = &projectileAnim->frames[0];

    s_lastVizardProjectileSkillStartMs = s_player.stateStartedMs;
    s_getsuga.active = 1U;
    s_getsuga.kind = BATTLE_PROJECTILE_VIZARD;
    s_getsuga.frameIndex = 0U;
    s_getsuga.hitConnected = 0U;
    s_getsuga.startedMs = nowMs;
    s_getsuga.vx = (s_player.facing < 0) ? -BATTLE_GETSUGA_SPEED
                                         : BATTLE_GETSUGA_SPEED;
    s_getsuga.y = (int16_t)(s_player.y - frame->pivotY);

    if (s_player.facing < 0)
    {
      s_getsuga.x = (int16_t)(s_player.x - 18 - (int16_t)frame->width);
    }
    else
    {
      s_getsuga.x = (int16_t)(s_player.x + 18);
    }
    return;
  }

  if ((s_player.character != COMBAT_CHARACTER_ICHIGO) ||
      (s_player.state != COMBAT_ANIM_SKILL) ||
      (s_player.frameIndex < BATTLE_GETSUGA_SPAWN_FRAME) ||
      (s_lastGetsugaSkillStartMs == s_player.stateStartedMs))
  {
    return;
  }

  s_lastGetsugaSkillStartMs = s_player.stateStartedMs;
  s_getsuga.active = 1U;
  s_getsuga.kind = BATTLE_PROJECTILE_GETSUGA;
  s_getsuga.frameIndex = 0U;
  s_getsuga.hitConnected = 0U;
  s_getsuga.startedMs = nowMs;
  s_getsuga.vx = (s_player.facing < 0) ? -BATTLE_GETSUGA_SPEED
                                       : BATTLE_GETSUGA_SPEED;
  s_getsuga.y = (int16_t)(s_player.y - 92);

  if (s_player.facing < 0)
  {
    s_getsuga.x = (int16_t)(s_player.x - 18 - (int16_t)GETSUGA_PROJECTILE_WIDTH);
  }
  else
  {
    s_getsuga.x = (int16_t)(s_player.x + 18);
  }
}

static void Battle_UpdateGetsuga(uint32_t nowMs)
{
  if (s_getsuga.active == 0U)
  {
    return;
  }

  uint8_t frameCount = GETSUGA_PROJECTILE_FRAME_COUNT;
  uint16_t width = GETSUGA_PROJECTILE_WIDTH;

  if (s_getsuga.kind == BATTLE_PROJECTILE_VIZARD)
  {
    const VizardMoveAnimation *projectileAnim =
        &vizard_move_animations[VIZARD_MOVE_SKILL_PROJECTILE];
    frameCount = projectileAnim->frameCount;
    width = projectileAnim->frames[s_getsuga.frameIndex].width;
  }

  s_getsuga.x = (int16_t)(s_getsuga.x + s_getsuga.vx);
  s_getsuga.frameIndex = (uint8_t)(((nowMs - s_getsuga.startedMs) /
                                    BATTLE_GETSUGA_FRAME_MS) %
                                   frameCount);

  if ((s_getsuga.x > (int16_t)LCD_PORT_WIDTH) ||
      ((s_getsuga.x + (int16_t)width) < 0))
  {
    s_getsuga.active = 0U;
  }
}

static void Battle_ResolveProjectileHit(BattleProjectile *projectile,
                                        CombatActor *owner,
                                        CombatActor *target,
                                        uint32_t nowMs)
{
  if ((projectile == 0) || (owner == 0) || (target == 0) ||
      (projectile->active == 0U) ||
      (projectile->hitConnected != 0U))
  {
    return;
  }

  const CombatHitboxDef *hitbox =
      (projectile->kind == BATTLE_PROJECTILE_VIZARD)
          ? &s_vizardProjectileHitbox
          : &s_getsugaHitbox;

  CombatBox projectileBox = {
      (int16_t)(projectile->x + hitbox->box.x),
      (int16_t)(projectile->y + hitbox->box.y),
      hitbox->box.w,
      hitbox->box.h,
  };
  CombatBox hurtboxWorld = CombatActor_GetHurtboxWorld(target);

  if (CombatBox_Overlap(projectileBox, hurtboxWorld) == 0U)
  {
    return;
  }

  CombatActor_ApplyHit(target, owner, hitbox, nowMs, 0U);
  projectile->hitConnected = 1U;
  projectile->active = 0U;
}

static uint8_t Battle_CaptureGetsuga(const BattleProjectile *projectile,
                                     BattleActorSnapshot *snapshot)
{
  if (snapshot != 0)
  {
    snapshot->valid = 0U;
  }

  if ((projectile == 0) || (snapshot == 0) ||
      (projectile->active == 0U))
  {
    return 0U;
  }

  if (projectile->kind == BATTLE_PROJECTILE_VIZARD)
  {
    const VizardMoveAnimation *projectileAnim =
        &vizard_move_animations[VIZARD_MOVE_SKILL_PROJECTILE];
    const VizardMoveFrame *frame =
        &projectileAnim->frames[projectile->frameIndex];

    snapshot->pixels = frame->pixels;
    snapshot->width = frame->width;
    snapshot->height = frame->height;
  }
  else
  {
    snapshot->pixels = getsuga_projectile_frames[projectile->frameIndex];
    snapshot->width = GETSUGA_PROJECTILE_WIDTH;
    snapshot->height = GETSUGA_PROJECTILE_HEIGHT;
  }

  snapshot->x = projectile->x;
  snapshot->y = projectile->y;
  snapshot->flipX = (projectile->vx < 0) ? 1U : 0U;
  snapshot->valid = 1U;

  return 1U;
}

static uint8_t Battle_CaptureChidori(const CombatActor *actor,
                                     BattleActorSnapshot *snapshot)
{
  const ChidoriFrame *frames = 0;
  uint8_t frameCount = 0U;
  uint8_t frameIndex = 0U;

  if (snapshot != 0)
  {
    snapshot->valid = 0U;
  }

  if ((actor == 0) || (snapshot == 0) ||
      (actor->character != COMBAT_CHARACTER_SASUKE) ||
      (actor->state != COMBAT_ANIM_SKILL))
  {
    return 0U;
  }

  if (actor->frameIndex < 3U)
  {
    frames = chidori_1_frames;
    frameCount = 4U;
    frameIndex = actor->frameIndex;
  }
  else if (actor->frameIndex < 6U)
  {
    frames = chidori_2_frames;
    frameCount = 3U;
    frameIndex = (uint8_t)(actor->frameIndex - 3U);
  }
  else if (actor->frameIndex < 9U)
  {
    frames = chidori_3_frames;
    frameCount = 3U;
    frameIndex = (uint8_t)(actor->frameIndex - 6U);
  }
  else
  {
    frames = chidori_4_frames;
    frameCount = 2U;
    frameIndex = (uint8_t)(actor->frameIndex - 9U);
  }

  if (frameIndex >= frameCount)
  {
    frameIndex = (uint8_t)(frameCount - 1U);
  }

  const ChidoriFrame *frame = &frames[frameIndex];
  snapshot->pixels = frame->pixels;
  snapshot->width = frame->width;
  snapshot->height = frame->height;
  snapshot->y = (int16_t)(actor->y - 36 - (int16_t)(frame->height / 2U));

  if (actor->facing < 0)
  {
    snapshot->x = (int16_t)(actor->x - 18 - (int16_t)frame->width);
    snapshot->flipX = 1U;
  }
  else
  {
    snapshot->x = (int16_t)(actor->x + 18);
    snapshot->flipX = 0U;
  }

