hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  snapshot->valid = 1U;
  return 1U;
}

static void Battle_DrawActorSnapshot(const BattleActorSnapshot *snapshot)
{
  if ((snapshot == 0) || (snapshot->valid == 0U))
  {
    return;
  }

  SpriteRender_Draw(snapshot->x,
                    snapshot->y,
                    snapshot->pixels,
                    snapshot->width,
                    snapshot->height,
                    snapshot->flipX);
}

static uint8_t Battle_ActorSnapshotEqual(const BattleActorSnapshot *a,
                                         const BattleActorSnapshot *b)
{
  if ((a == 0) || (b == 0))
  {
    return 0U;
  }

  return ((a->valid == b->valid) &&
          (a->pixels == b->pixels) &&
          (a->width == b->width) &&
          (a->height == b->height) &&
          (a->x == b->x) &&
          (a->y == b->y) &&
          (a->flipX == b->flipX))
             ? 1U
             : 0U;
}

static void Battle_DirtyRectAddSnapshot(BattleDirtyRect *rect,
                                        const BattleActorSnapshot *snapshot)
{
  if ((rect == 0) || (snapshot == 0) || (snapshot->valid == 0U) ||
      (snapshot->width == 0U) || (snapshot->height == 0U))
  {
    return;
  }

  int16_t x0 = snapshot->x;
  int16_t y0 = snapshot->y;
  int16_t x1 = (int16_t)(snapshot->x + (int16_t)snapshot->width);
  int16_t y1 = (int16_t)(snapshot->y + (int16_t)snapshot->height);

  if (x0 < 0)
  {
    x0 = 0;
  }
  if (y0 < 0)
  {
    y0 = 0;
  }
  if (x1 > (int16_t)LCD_PORT_WIDTH)
  {
    x1 = (int16_t)LCD_PORT_WIDTH;
  }
  if (y1 > (int16_t)LCD_PORT_HEIGHT)
  {
    y1 = (int16_t)LCD_PORT_HEIGHT;
  }

  if ((x1 <= x0) || (y1 <= y0))
  {
    return;
  }

  if (rect->valid == 0U)
  {
    rect->x = x0;
    rect->y = y0;
    rect->w = (int16_t)(x1 - x0);
    rect->h = (int16_t)(y1 - y0);
    rect->valid = 1U;
    return;
  }

  int16_t rx1 = (int16_t)(rect->x + rect->w);
  int16_t ry1 = (int16_t)(rect->y + rect->h);

  if (x0 < rect->x)
  {
    rect->x = x0;
  }
  if (y0 < rect->y)
  {
    rect->y = y0;
  }
  if (x1 > rx1)
  {
    rx1 = x1;
  }
  if (y1 > ry1)
  {
    ry1 = y1;
  }

  rect->w = (int16_t)(rx1 - rect->x);
  rect->h = (int16_t)(ry1 - rect->y);
}

static void Battle_DrawSnapshotChange(const BattleActorSnapshot *previous,
                                      const BattleActorSnapshot *next,
                                      const BattleActorSnapshot *player,
                                      const BattleActorSnapshot *cpu,
                                      const BattleActorSnapshot *projectile,
                                      const BattleActorSnapshot *chidori,
                                      uint8_t allowSplit)
{
  BattleDirtyRect dirty = {0, 0, 0, 0, 0U};
  BattleDirtyRect previousDirty = {0, 0, 0, 0, 0U};
  BattleDirtyRect nextDirty = {0, 0, 0, 0, 0U};

  Battle_DirtyRectAddSnapshot(&previousDirty, previous);
  Battle_DirtyRectAddSnapshot(&nextDirty, next);

  if ((allowSplit != 0U) &&
      (Battle_DirtyRectsShouldSplit(previousDirty, nextDirty) != 0U))
  {
    Battle_DrawDirtyRect(previousDirty, player, cpu, projectile, chidori);
    Battle_DrawDirtyRect(nextDirty, player, cpu, projectile, chidori);
    return;
  }

  Battle_DirtyRectAddSnapshot(&dirty, previous);
  Battle_DirtyRectAddSnapshot(&dirty, next);
  Battle_DrawDirtyRect(dirty, player, cpu, projectile, chidori);
}

static uint8_t Battle_DirtyRectsShouldSplit(BattleDirtyRect a,
                                            BattleDirtyRect b)
{
  if ((a.valid == 0U) || (b.valid == 0U))
  {
    return 0U;
  }

  int16_t ax1 = (int16_t)(a.x + a.w);
  int16_t ay1 = (int16_t)(a.y + a.h);
  int16_t bx1 = (int16_t)(b.x + b.w);
  int16_t by1 = (int16_t)(b.y + b.h);

  int16_t unionX0 = (a.x < b.x) ? a.x : b.x;
  int16_t unionY0 = (a.y < b.y) ? a.y : b.y;
  int16_t unionX1 = (ax1 > bx1) ? ax1 : bx1;
  int16_t unionY1 = (ay1 > by1) ? ay1 : by1;

  uint32_t areaA = (uint32_t)a.w * (uint32_t)a.h;
  uint32_t areaB = (uint32_t)b.w * (uint32_t)b.h;
  uint32_t unionArea = (uint32_t)(unionX1 - unionX0) *
                       (uint32_t)(unionY1 - unionY0);

  return (unionArea > ((areaA + areaB) + ((areaA + areaB) / 2U))) ? 1U : 0U;
}

static void Battle_DrawDirtyRect(BattleDirtyRect rect,
                                 const BattleActorSnapshot *player,
                                 const BattleActorSnapshot *cpu,
                                 const BattleActorSnapshot *projectile,
                                 const BattleActorSnapshot *chidori)
{
  if ((rect.valid == 0U) || (rect.w <= 0) || (rect.h <= 0))
  {
    return;
  }

  for (int16_t row = 0; row < rect.h; row++)
  {
    uint16_t y = (uint16_t)(rect.y + row);

    for (int16_t col = 0; col < rect.w; col++)
    {
      uint16_t x = (uint16_t)(rect.x + col);
      s_compositeRun[col] =
          s_backgroundPixels[((uint32_t)y * LCD_PORT_WIDTH) + x];
    }

    Battle_ComposeActorRow(rect, player, y);
    Battle_ComposeActorRow(rect, cpu, y);
    Battle_ComposeActorRow(rect, projectile, y);
    Battle_ComposeActorRow(rect, chidori, y);

    LCD_Port_DrawPixels((uint16_t)rect.x,
                        y,
                        (uint16_t)rect.w,
                        s_compositeRun);
  }
}

static void Battle_ComposeActorRow(BattleDirtyRect rect,
                                   const BattleActorSnapshot *snapshot,
                                   uint16_t screenY)
{
  int16_t y = (int16_t)screenY;

  if ((snapshot == 0) || (snapshot->valid == 0U) ||
      (y < snapshot->y) ||
      (y >= (int16_t)(snapshot->y + (int16_t)snapshot->height)))
  {
    return;
  }

  int16_t x0 = snapshot->x;
  int16_t x1 = (int16_t)(snapshot->x + (int16_t)snapshot->width);
  int16_t rectX1 = (int16_t)(rect.x + rect.w);

  if (x0 < rect.x)
  {
    x0 = rect.x;
  }
  if (x1 > rectX1)
  {
    x1 = rectX1;
  }

  if (x1 <= x0)
  {
    return;
  }

  uint16_t localY = (uint16_t)(y - snapshot->y);

  for (int16_t screenX = x0; screenX < x1; screenX++)
  {
    uint16_t localX = (uint16_t)(screenX - snapshot->x);
    uint16_t srcX = (snapshot->flipX != 0U)
                        ? (uint16_t)(snapshot->width - 1U - localX)
                        : localX;
    uint16_t color = snapshot->pixels[((uint32_t)localY * snapshot->width) + srcX];

    if (color != SPRITE_COLOR_KEY_RGB565)
    {
      s_compositeRun[screenX - rect.x] = color;
    }
  }
}

static void Battle_DrawDebugBoxes(void)
{
#if BATTLE_DEBUG_BOXES
  const CombatHitboxDef *unusedHitbox = 0;
  Battle_DrawBox(CombatActor_GetHurtboxWorld(&s_player), RGB565_HURTBOX);
  Battle_DrawBox(CombatActor_GetHurtboxWorld(&s_cpu), RGB565_HURTBOX);
  Battle_DrawBox(CombatActor_GetHitboxWorld(&s_player, &unusedHitbox),
                 RGB565_HITBOX);
  Battle_DrawBox(CombatActor_GetHitboxWorld(&s_cpu, &unusedHitbox),
                 RGB565_HITBOX);
#endif
}

#if BATTLE_DEBUG_BOXES
static void Battle_DrawBox(CombatBox box, uint16_t color)
{
  if ((box.w <= 0) || (box.h <= 0))
  {
    return;
  }

