hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  int16_t x0 = box.x;
  int16_t y0 = box.y;
  int16_t x1 = (int16_t)(box.x + box.w);
  int16_t y1 = (int16_t)(box.y + box.h);

  if ((x1 <= 0) || (y1 <= 0) ||
      (x0 >= (int16_t)LCD_PORT_WIDTH) ||
      (y0 >= (int16_t)LCD_PORT_HEIGHT))
  {
    return;
  }

  x0 = CombatBox_ClampI16(x0, 0, (int16_t)(LCD_PORT_WIDTH - 1U));
  y0 = CombatBox_ClampI16(y0, 0, (int16_t)(LCD_PORT_HEIGHT - 1U));
  x1 = CombatBox_ClampI16(x1, 0, (int16_t)(LCD_PORT_WIDTH - 1U));
  y1 = CombatBox_ClampI16(y1, 0, (int16_t)(LCD_PORT_HEIGHT - 1U));

  ILI9341_DrawHollowRectangleCoord((uint16_t)x0,
                                   (uint16_t)y0,
                                   (uint16_t)x1,
                                   (uint16_t)y1,
                                   color);
}
#endif

static void Battle_DrawHud(void)
{
  LCD_Port_FillRect(0U, 0U, LCD_PORT_WIDTH, 37U, RGB565_HUD_BG);
  LCD_Port_FillRect(0U, 36U, LCD_PORT_WIDTH, 1U, RGB565_HUD_FRAME);

  ILI9341_DrawText("VIZARD", FONT1, 10U, 3U, RGB565_WHITE, RGB565_HUD_BG);
  ILI9341_DrawText("SASUKE", FONT1, 262U, 3U, RGB565_WHITE, RGB565_HUD_BG);

  Battle_DrawHealthBar(10U, 15U, s_player.hp, RGB565_ACCENT_CYAN, 0U);
  Battle_DrawManaBar(10U, 27U, 0U);

  Battle_DrawHealthBar(206U, 15U, s_cpu.hp, RGB565_ACCENT_ORANGE, 1U);
  Battle_DrawManaBar(226U, 27U, 1U);

  ILI9341_DrawHollowRectangleCoord(142U, 5U, 177U, 27U, RGB565_HUD_FRAME);
  LCD_Port_FillRect(143U, 6U, 34U, 21U, RGB565_BLACK);
  ILI9341_DrawText("60", FONT3, 148U, 8U, RGB565_WHITE, RGB565_BLACK);
}

static void Battle_DrawHealthBar(uint16_t x, uint16_t y, uint16_t hp,
                                 uint16_t borderColor, uint8_t reverse)
{
  uint16_t fill = (hp > 30U) ? RGB565_HP_GOOD : RGB565_HP_WARN;

  Battle_DrawMeter(x, y, 104U, 8U, hp, 100U, fill, RGB565_HP_BACK,
                   borderColor, reverse);
}

static void Battle_DrawManaBar(uint16_t x, uint16_t y, uint8_t reverse)
{
  Battle_DrawMeter(x, y, 84U, 5U, 100U, 100U, RGB565_MANA,
                   RGB565_MANA_BACK, RGB565_HUD_FRAME, reverse);
}

static void Battle_DrawMeter(uint16_t x, uint16_t y, uint16_t width,
                             uint16_t height, uint16_t value,
                             uint16_t maxValue, uint16_t fillColor,
                             uint16_t backColor, uint16_t borderColor,
                             uint8_t reverse)
{
  if ((width < 3U) || (height < 3U) || (maxValue == 0U))
  {
    return;
  }

  uint16_t innerWidth = (uint16_t)(width - 2U);
  uint16_t innerHeight = (uint16_t)(height - 2U);
  uint16_t clampedValue = (value > maxValue) ? maxValue : value;
  uint16_t fillWidth =
      (uint16_t)(((uint32_t)innerWidth * clampedValue) / maxValue);

  ILI9341_DrawHollowRectangleCoord(x, y,
                                   (uint16_t)(x + width - 1U),
                                   (uint16_t)(y + height - 1U),
                                   borderColor);
  LCD_Port_FillRect((uint16_t)(x + 1U), (uint16_t)(y + 1U),
                    innerWidth, innerHeight, backColor);

  if (fillWidth == 0U)
  {
    return;
  }

  uint16_t fillX = (reverse != 0U)
                       ? (uint16_t)(x + 1U + innerWidth - fillWidth)
                       : (uint16_t)(x + 1U);
  LCD_Port_FillRect(fillX, (uint16_t)(y + 1U), fillWidth, innerHeight,
                    fillColor);
}

static void Battle_DrawBackground(void)
{
  Battle_DrawStaticSky();
  Battle_DrawGround();
  Battle_DrawArenaMarks();
}

static void Battle_BuildBackgroundCache(void)
{
  for (uint16_t y = 0U; y < LCD_PORT_HEIGHT; y++)
  {
    for (uint16_t x = 0U; x < LCD_PORT_WIDTH; x++)
    {
      s_backgroundPixels[((uint32_t)y * LCD_PORT_WIDTH) + x] =
          Battle_GetBackgroundPixel(x, y);
    }
  }
}

static void Battle_DrawStaticSky(void)
{
  LCD_Port_FillRect(0U, 0U, LCD_PORT_WIDTH, 48U, RGB565_SKY_TOP);
  LCD_Port_FillRect(0U, 48U, LCD_PORT_WIDTH, 48U, RGB565_SKY_MID);
  LCD_Port_FillRect(0U, 96U, LCD_PORT_WIDTH, 86U, RGB565_SKY_LOW);
}

static void Battle_DrawGround(void)
{
  LCD_Port_FillRect(0U, 182U, LCD_PORT_WIDTH, 58U, RGB565_GROUND);
  LCD_Port_FillRect(0U, 182U, LCD_PORT_WIDTH, 6U, RGB565_GROUND_TOP);
  LCD_Port_FillRect(0U, 232U, LCD_PORT_WIDTH, 8U, RGB565_GROUND_DARK);
}

static void Battle_DrawArenaMarks(void)
{
  LCD_Port_FillRect(40U, 190U, 240U, 2U, RGB565_LINE);
  LCD_Port_FillRect(158U, 186U, 4U, 42U, RGB565_LINE);
  Battle_FillSafe(58, 199, 42, 4, RGB565_ACCENT_CYAN);
  Battle_FillSafe(220, 199, 42, 4, RGB565_ACCENT_ORANGE);
}

static uint16_t Battle_GetBackgroundPixel(uint16_t x, uint16_t y)
{
  uint16_t color = RGB565_SKY_LOW;

  if (y < 48U)
  {
    color = RGB565_SKY_TOP;
  }
  else if (y < 96U)
  {
    color = RGB565_SKY_MID;
  }
  else if (y >= 182U)
  {
    color = RGB565_GROUND;

    if (y < 188U)
    {
      color = RGB565_GROUND_TOP;
    }
    else if (y >= 232U)
    {
      color = RGB565_GROUND_DARK;
    }

    if ((y >= 190U) && (y < 192U) && (x >= 40U) && (x < 280U))
    {
      color = RGB565_LINE;
    }

    if ((x >= 158U) && (x < 162U) && (y >= 186U) && (y < 228U))
    {
      color = RGB565_LINE;
    }

    if ((x >= 58U) && (x < 100U) && (y >= 199U) && (y < 203U))
    {
      color = RGB565_ACCENT_CYAN;
    }

    if ((x >= 220U) && (x < 262U) && (y >= 199U) && (y < 203U))
    {
      color = RGB565_ACCENT_ORANGE;
    }
  }

  return color;
}

static void Battle_FillSafe(int16_t x, int16_t y, int16_t width,
                            int16_t height, uint16_t color)
{
  if ((width <= 0) || (height <= 0))
  {
    return;
  }

  int16_t x2 = (int16_t)(x + width);
  int16_t y2 = (int16_t)(y + height);

  if ((x >= (int16_t)LCD_PORT_WIDTH) || (y >= (int16_t)LCD_PORT_HEIGHT) ||
      (x2 <= 0) || (y2 <= 0))
  {
    return;
  }

  if (x < 0)
  {
    width = (int16_t)(width + x);
    x = 0;
  }

  if (y < 0)
  {
    height = (int16_t)(height + y);
    y = 0;
  }

  if ((x + width) > (int16_t)LCD_PORT_WIDTH)
  {
    width = (int16_t)((int16_t)LCD_PORT_WIDTH - x);
  }

  if ((y + height) > (int16_t)LCD_PORT_HEIGHT)
  {
    height = (int16_t)((int16_t)LCD_PORT_HEIGHT - y);
  }

  LCD_Port_FillRect((uint16_t)x, (uint16_t)y, (uint16_t)width,
                    (uint16_t)height, color);
}
